Repository: sheilagomes/wp-trad
Catalog: tm/PHP_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: You can select arguments to add to the configure on line 10 below from the Complete list of configure options.
pt_br: Você pode selecionar argumentos para adicionar ao configure na linha 10 abaixo através da Lista completa de opções do configure.

source: The version numbers have been omitted here, to ensure the instructions are not incorrect.
pt_br: Os números de versões foram omitidos aqui, para assegurar que as instruções não estejam incorretas.

source: You will need to replace the 'xxx' here with the correct values from your files.
pt_br: Você deverá trocar o 'xxx' aqui com os valores corretos dos seus arquivos.

source: Example 3-5.
pt_br: Exemplo 3-5.

source: Installation Instructions (Apache Shared Module Version) for PHP 4
pt_br: Instruções de Instalação (Apache Versão de Módulo Compartilhado) para PHP 4

source: 1. gunzip apache_xxx.tar.gz 2. tar -xvf apache_xxx.tar 3. gunzip php-xxx.tar.gz 4. tar -xvf php-xxx.tar 5. cd apache_xxx 6.. / configure --prefix= / www --enable-module=so 7. make 8. make install 9. cd.. / php-xxx 10.. / configure --with-mysql --with-apxs= / www / bin / apxs 11. make 12. make install If you decide to change your configure options after installation you only need to repeat the last three steps.
pt_br: 1. gunzip apache_xxx.tar.gz 2. tar -xvf apache_xxx.tar 3. gunzip php-xxx.tar.gz 4. tar -xvf php-xxx.tar 5. cd apache_xxx 6.. / configure --prefix= / www --enable-module=so 7. make 8. make install 9. cd.. / php-xxx 10.. / configure --with-mysql --with-apxs= / www / bin / apxs 11. make 12. make install Se você decidir mudar as opções de seu configure depois da instalação você precisará somente repetir os últimos tres passos.

source: You only need to restart apache for the new module to take effect.
pt_br: Você somente precisará reiniciar o apache para o novo módulo funcionar.

source: A recompile of Apache is not needed.
pt_br: Não será necessário recompilar o Apache.

source: 13. cp php.ini-dist / usr / local / lib / php.ini You can edit your .ini file to set PHP options.
pt_br: 13. cp php.ini-dist / usr / local / lib / php.ini Você pode editar o seu arquivo .ini para configurar as opções do PHP.

source: If you prefer this file in another location, use --with-config-file-path= / path in step 10.
pt_br: Se você preferir que este arquivo fique em outro lugar, use a opção --with-config-file-path= / caminho no passo 10.

source: Edit your httpd.conf or srm.conf file and check that these lines are present and not commented out:
pt_br: Edite o seu arquivo httpd.conf ou srm.conf e verifique que estas linas estejam presentes e não estejam comentadas:

source: AddType application / x-httpd-php .php LoadModule php4_module libexec / libphp4.so You can choose any extension you wish here. .php is simply the one we suggest.
pt_br: AddType application / x-httpd-php .php LoadModule php4_module libexec / libphp4.so Você pode escolher qualquer extensão aqui. .php é simplesmente uma sugestão que nós damos.

source: You can even include .html, and .php3 can be added for backwards compatibility.
pt_br: Você também pode incluir .html, e .php3 pode ser adicionado para compatibilidade com versões antigas.

source: The path on the right hand side of the LoadModule statement must point to the path of the PHP module on your system.
pt_br: O caminho no lado direito do comando LoadModule deve apontar para para o caminho do módulo PHP do seu sistema.

source: The above statement is correct for the steps shown above.
pt_br: O comando acima está correto para os passos mostrados acima.

source: Use your normal procedure for starting the Apache server. (You must stop and restart the server, not just cause the server to reload by use a HUP or USR1 signal.)
pt_br: Use seu procedimento normal para iniciar o servidor Apache. (Você deve parar e reiniciar o servidor, não somente fazer um reinício enviando um sinal HUP ou USR1.)

source: Depending on your Apache install and Unix variant, there are many possible ways to stop and restart the server.
pt_br: Dependendo da sua instalação do Apache e das variações Unix, existem inúmeras maneiras possíveis de parar e reiniciar o servidor.

source: Below are some typical lines used in restarting the server, for different apache / unix installations.
pt_br: Abaixo estão algumas linhas típicas usadas para reiniciar e o servidor, para instalações de versões de apache / unix.

source: You should replace / path / to / with the path to these applications on your systems.
pt_br: Você deve trocar / caminho / para / pelo caminho destas aplicações nos seus sistemas.

source: Several Linux and SysV variants: / etc / rc.d / init.d / httpd restart 2.
pt_br: Inúmeras variações de sistemas Linux: / etc / rc.d / init.d / httpd restart 2.

source: Using apachectl scripts: / path / to / apachectl stop / path / to / apachectl start 3. httpdctl and httpsdctl (Using OpenSSL), similar to apachectl: / path / to / httpsdctl stop / path / to / httpsdctl start 4.
pt_br: Usando os scripts apachectl: / caminho / para / apachectl stop / caminho / para / apachectl start 3. httpdctl and httpsdctl (Usando OpenSSL), igual ao apachectl: / caminho / para / httpsdctl stop / caminho / para / httpsdctl start 4.

source: Using mod_ssl, or another SSL server, you may want to manually stop and start: / path / to / apachectl stop / path / to / apachectl startssl
pt_br: Usando mod_ssl, ou outro servidor SSL, você pode querer iniciar ou reiniciar manualmente: / caminho / para / apachectl stop / caminho / para / apachectl startssl

source: Different examples of compiling PHP for apache are as follows:
pt_br: Exemplos diferentes de compilação do PHP para apache estão a seguir:

source: This will create a libphp4.so shared library that is loaded into Apache using a LoadModule line in Apache 's httpd.conf file.
pt_br: Isto irá criar uma biblioteca compartilhada libphp4.so que é carregada com o Apache usando uma linha LoadModule no arquivo httpd.conf do Apache.

source: The PostgreSQL support is embedded into this libphp4.so library.
pt_br: O suporte ao PostgreSQL está embutido dentro da biblioteca compartilhada libphp4.so.

source: This will create a libphp4.so shared library for Apache, but it will also create a pgsql.so shared library that is loaded into PHP either by using the extension directive in php.ini file or by loading it explicitly in a script using the dl() function.
pt_br: Isto irá criar uma biblioteca compartilhada libphp4.so para o Apache, mas isto também criará uma biblioteca compartilhada pgsql.so que é carregada com o PHP tanto ao usar a diretiva de extensão no arquivo php.ini ou então carregando ela explícitamente no script usando a função dl().

source: . / configure --with-apache= / path / to / apache_source --with-pgsql
pt_br: . / configure --with-apache= / caminho / para / apache_source --with-pgsql

source: This will create a libmodphp4.a library, a mod_php4.c and some accompanying files and copy this into the src / modules / php4 This will create a libmodphp4.a library, a mod_php4.c and some accompanying files and copy this into the src / modules / php4 directory in the Apache source tree.
pt_br: Isto irá criar uma biblioteca libmodphp4.a, o arquivo mod_php4.c e vários arquivos dependentes e copiará eles para o diretório src / modules / php4 na árvore de diretório do código fonte do Apache.

source: Then you compile Apache using --activate-module=src / modules / php4 / libphp4.a and the Apache build system will create libphp4.a and link it statically into the httpd binary.
pt_br: Então você compilará o Apache usando a opção --activate-module=src / modules / php4 / libphp4.a e o sistema de compilação do Apache irá criar o arquivo libphp4.a e fará um link estático dentro do binário httpd.

source: The PostgreSQL support is included directly into this httpd binary, so the final result here is a single httpd binary that includes all of Apache and all of PHP.
pt_br: O suporte ao PostgreSQL estará incluído diretamente neste binário httpd, então o resultado final aqui será um único arquivo binário httpd que incluirá tudo do Apache e tudo do PHP.

source: . / configure --with-apache= / path / to / apache_source --with-pgsql=shared
pt_br: . / configure --with-apache= / caminho / para / apache_source --with-pgsql=shared

source: Same as before, except instead of including PostgreSQL support directly into the final httpd you will get a pgsql.so shared library that you can load into PHP from either the php.ini file or directly using dl().
pt_br: Mesmo que o anterior, exceto em vez de incluir o suporte ao PostgreSQL diretamente no binário httpd você terá uma biblioteca compartilhada pgsql.so que você poderá carregar com o PHP tanto do arquivo php.ini ou diretamente usando a função dl().

source: When choosing to build PHP in different ways, you should consider the advantages and drawbacks of each method.
pt_br: Quanto estiver decidindo compilar o PHP com maneiras diferentes, você deverá considerar as vantages e disvantagens de cada método.

source: Building PHP into apache (static method) means that PHP will load and run faster.
pt_br: Complilando como uma biblioteca compartilhada significará que você poderá compilar o apache separadamente, e não terá que recompilar tudo quando quiser adicionar ou mudar o seu PHP. compilando o PHP dentro do apache (método estático) significará que o PHP irá carregar e rodar rapidamente.

source: For more information, see the Apache webpage on DSO support.
pt_br: Para maiores informações, veja a página web do Apache que fala sobre Suporte a Objetos Dinâmicos Compartilhados.

source: Apache 's default http.conf currently ships with a section that looks like this:
pt_br: O arquivo httpd.conf padrão do Apache atualmente já contém uma seção que se parece com isso:

source: Make sure you specify the installed version of apxs when using --with-apxs= / path / to / apxs.
pt_br: Tenha certeza de especificar a versão instalada do apxs quando usar a opção --with-apxs= / caminho / para / apxs.

source: You must NOT use the apxs version that is in the apache sources but the one that is actually installed on your system.
pt_br: Instalando o PHP em Windows com Apache 1.3.x

source: There are two ways to set up PHP to work with Apache 1.3.x on Windows.
pt_br: Existem duas maneiras de configurar o PHP para funcionar com o Apache 1.3.x em Windows.

source: One is to use the CGI binary (php.exe), the other is to use the Apache module DLL.
pt_br: Uma é usando o binário CGI (php.exe), a outra é usando a bliblioteca compartilhada (DLL) como módulo para o Apache (SAPI).

source: In either case you need to stop the Apache server, and edit your srm.conf or httpd.conf to configure Apache to work with PHP.
pt_br: Nos dois casos você precisará parar o Servidor Apache, e editar seu arquivo srm.conf ou httpd.conf para configurar o Apache para funcionar com o PHP.

source: It is worth noting here that now the SAPI module has been made more stable under windows, we recommend it 's use above the CGI binary, since it is more transparent and secure.
pt_br: Vale deixar claro aqui que agora o módulo SAPI tornou-se muito mais estável no windows, nós recomendamos o seu uso em vez do binário CGI, por ele ser mais transparente e seguro.

source: Although there can be a few variations of configuring PHP under Apache, these are simple enough to be used by the newcomer.
pt_br: Embora possa ter algumas variações de configurar o PHP com Apache, elas são fáceis suficientemente para ser feitas por um usuário sem experiência.

source: Please consult the Apache Docs for further configuration directives.
pt_br: Por favor consulte os Documentos do Apache para maiores diretivas de configuração.

source: If you unziped the PHP package to c:\php\ as described in the Manual Installation Steps section, you need to insert these lines to your Apache configuration file to set up the CGI binary:
pt_br: Se você descompactou o pacote do PHP para c:\php\ como descrito na seção Passos de Instalação Manual, você precisará inserir estas linhas no seu arquivo de configuração do Apache para configurar o binário CGI:

source: By using the CGI setup, your server is open to several possible attacks.
pt_br: Usando a configuração do binário CGI, o seu servidor está aberto a vários tipos possívels de ataque.

source: Please read our CGI security section to learn how to defend yourself from attacks.
pt_br: Por favor leia nossa seção Segurança em CGI para aprender como defender-se de ataques.

source: If you would like to use PHP as a module in Apache, be sure to move php4ts.dll to the windows / system (for Windows 9x / Me) or winnt / system32 (for Windows NT / 2000 / XP) directory, overwriting any older file.
pt_br: Se você preferir usar o PHP como um módulo no Apache, esteja certo de mover o arquivo php4ts.dll para o diretório windows / system (em Windows 9x / Me) ou winnt / system32 (para Windows NT / 2000 / XP), sobrescrevendo qualquer arquivo antigo.

source: Then you should add the following two lines to you Apache conf file:
pt_br: Então você deverá adiciomar as duas linhas a seguir em seu arquivo de configuração do Apache:

source: After changing the configuration file, remember to restart the server, for example, NET STOP APACHE followed by NET START APACHE, if you run Apache as a Windows Service, or use your regular shortcuts.
pt_br: Após mudar o arquivo de configuração, lembre-se de reiniciar o servidor, por exemplo, NET STOP APACHE seguido por NET START APACHE, se você roda o Apache como um Serviço Windows, ou use os atalhos comuns no menu iniciar.

source: You may find after using the windows installer for Apache that you need to define the AddModule directive for mod_php4.c in the configuration file (httpd.conf).
pt_br: Você irá descobrir que após usar o windows installer para Apache que você deverá definir a diretriz AddModule para mod_php4.c no arquivo de configuração (httpd.conf).

source: This is done by adding AddModule mod_php4.c to the AddModule list, near the beginning of the configuration file.
pt_br: Isto pode ser feito adicionando AddModule mod_php4.c para a lista AddModule, perto do começo do arquivo de configuração.

source: This is especially important if the ClearModuleList directive is defined.
pt_br: Isto é especialmente importante se a diretriz ClearModuleList Isto é especialmente importante se a diretriz ClearModuleList estiver definida.

source: Failure to do this may mean PHP will not be registered as an Apache module.
pt_br: Falhas ao configurar isto pode resultar em não definir o PHP como um módulo para Apache.

source: There are 2 ways you can use the source code highlighting feature, however their ability to work depends on your installation.
pt_br: Existem duas maneiras para você poder usar a função de destaque de códigos fonte, contudo dependerá da maneira de sua instalação para esta função funcionar corretamente.

source: If you have configured Apache to use PHP as an ISAPI module, then by adding the following line to your configuration file you can use this feature:
pt_br: Se você configurou o Apache para usar o PHP como um módulo SAPI, então adicionando a seguinte linha ao seu arquivo de configuração você poderá usar esta função:

source: If you chose to configure Apache to use PHP as a CGI binary, you will need to use the show_source() function.
pt_br: Se você escolher configurar o Apache para usar o PHP como um binário CGI, você precisará usar a função show_source().

source: To do this simply create a PHP script file and add this code: ?php show_source ("original_php_script.php");?.
pt_br: Para fazer isto simplesmente crie um arquivo de script PHP e adicione este código: ?php show_source ("php_original_script.php");?.

source: Substitute original_php_script.php with the name of the file you wish to show the source of.
pt_br: Troque php_original_script.php pelo nome do arquivo que você quer que seja mostrado o código fonte.

source: On Win-Apache all backslashes in a path statement such as "c:\directory\file.ext", must be converted to forward slashes, as "c: / directory / file.ext".
pt_br: No Apache em Windows todas as barras invertidas em uma definição de caminho como descrito aqui "c:\diretorio\arquivo.ext", devem ser convertidas para barras normais, como descrito aqui "c: / diretorio / arquivo.ext".

source: Before installing first, you need to know what do you want to use PHP for.
pt_br: Instalação

source: There are three main fields you can use PHP, as described in the What can PHP do? section:
pt_br: General Installation Considerations

source: Example 3-9.
pt_br: Exemplo 3-9.

source: The default is to build PHP as a CGI program.
pt_br: Servers-CGI / Commandline

source: This way you may catch a problem with PHP on your platform early instead of having to struggle with it later.
pt_br: Benchmarking

source: Use the max_execution_time configuration setting to control this time for your own scripts. make bench ignores the configuration file.
pt_br: Using Variables

source: These are only used at compile time.
pt_br: Nota:

source: These options are only used in PHP 4 as of PHP 4.1.0.
pt_br: Nota:

source: If you want to compile an older version, some options will probably not be available.
pt_br: Database options

source: Disable GD support.
pt_br: Graphics options

source: Include ming support.
pt_br: Misc options

source: Specify path to the installed AOLserver.
pt_br: Server options

source: Example 3-1.
pt_br: Exemplo 3-1.

source: Check the 'Execute' checkbox, and confirm.
pt_br: Windows NT / 2000 / XP and IIS 4 or newer

source: If you are unfamiliar with building and compiling your own software, it 's worth checking whether somebody has already built a packaged version of PHP with the features you need.
pt_br: Compiling for OS X server

source: Example 3-2.
pt_br: Exemplo 3-2.

source: 9. make 10. make install 11. copy and rename the php.ini-dist file to your "bin" directory from your PHP 4 source directory: cp php.ini-dist / usr / local / bin / php.ini or (if your don't have a local directory) cp php.ini-dist / usr / bin / php.ini
pt_br: Compiling for MacOS X client

source: Example 3-10.
pt_br: Exemplo 3-10.

source: Example 3-11.
pt_br: Exemplo 3-11.

source: Example 3-12.
pt_br: Exemplo 3-12.

source: Graeme Hoose (GraemeHoose@BrightStation.com) Init fn="load-modules "shlib=" / path / to / server4 / bin / libphp4.so" funcs="php4_init,php4_close,php4_execute,php4_auth_trans "Init fn="php4_init" LateInit="yes "
pt_br: Installing PHP with Netscape on Windows

source: Example 3-3.
pt_br: Exemplo 3-3.

source: Read the packages( 7) manual page for more information about binary packages on OpenBSD.
pt_br: Using Ports

source: Some problems are more common than others.
pt_br: Read the FAQ

source: If you want to get help on the mailing list, please try to be precise and give the necessary details about your environment (which operating system, what PHP version, what web server, if you are running PHP as CGI or a server module, etc.), and preferably enough code to make others able to reproduce and test your problem.
pt_br: Bug reports

source: Example 3-4.
pt_br: Exemplo 3-4.

source: Use your normal procedure for restarting the Apache server. (You must stop and restart the server, not just cause the server to reload by use a HUP or USR1 signal.)
pt_br: Building

source: This automatically working setup gives you an instantly working PHP installation, but it is not meant to be used on online servers.
pt_br: Manual Installation Steps

source: You can get the latest development version using anonymous CVS, a snapshot or the most recent released source tarball.
pt_br: Putting it all together

source: A properly installed Cygwin environment provides the mandatory files bison.simple and bison.exe.
pt_br: Configure MVC + +

source: You must build the resolv.lib library.
pt_br: Build resolv.lib

source: In order to build the SAPI module (php4isapi.dll for integrating PHP with Microsoft IIS, set your active configuration to php4isapi-whatever-config and build the desired dll.
pt_br: Installation of Windows extensions

source: Table 3-1.
pt_br: Tabela 3-1.

source: PHP (recursive acronym for "PHP:
pt_br: O que é PHP?

source: Simple answer, but what does that mean?
pt_br: Hypertext Preprocessor") é uma linguagem de script Open Source de uso geral, muito utilizada e especialmente guarnecida para o desenvolvimento de aplicações Web embútivel dentro do HTML.

source: An example:
pt_br: Uma resposta simples, mas o que isso significa?

source: Example 1-1.
pt_br: Exemplo 1-1.

source: An introductory example
pt_br: Um exemplo introdutório

source: html head title Example / title / head body ?php echo "Hi, I'm a PHP script !";? / body / html
pt_br: html head title Exemplo / title / head body ?php echo "Olá, Eu sou um script PHP !";? / body / html

source: Notice how this is different from a script written in other languages like Perl or C - - instead of writing a program with lots of commands to output HTML, you write an HTML script with some embedded code to do something (in this case, output some text).
pt_br: Note como isso é diferente de scripts CGI escritos em outras linguagens como Perl ou C -- - ao invés de escrever um programa com um monte de comandos para imprimir HTML, você escreve um arquivo HTML com algum código inserido para fazer alguma coisa (nesse caso, imprimir um pouco de texto).

source: The PHP code is enclosed in special start and end tags that allow you to jump into and out of "PHP mode".
pt_br: O código PHP é delimitado por tags iniciais e finais que lhe permitem pular pra dentro e pra fora do "modo PHP".

source: What distinguishes PHP from something like client-side JavaScript is that the code is executed on the server.
pt_br: O que distingui o PHP de algo como Javascript no lado do cliente é que o código é executado no servidor.

source: If you were to have a script similar to the above on your server, the client would receive the results of running that script, with no way of determining what the underlying code may be.
pt_br: Se você tivesse um script similar ao acima em seu servidor, o cliente receberia os resultados da execução desse script, sem nenhum modo de determinar como é o código fonte.

source: You can even configure your web server to process all your HTML files with PHP, and then there 's really no way that users can tell what you have up your sleeve.
pt_br: Você pode inclusive configurar seu servidor para processar todos os seus arquivos HTML como PHP, e então não haverá nenhum modo dos usuários descobrirem que se você usa essa linguagem ou não.

source: The best things in using PHP are that it is extremely simple for a newcomer, but offers many advanced features for a professional programmer.
pt_br: A melhor coisa em usar PHP está no fato de ele ser extremamente simples para um iniciante, mas oferece muitos recursos para o programador profissional.

source: Don' t be afraid reading the long list of PHP's features.
pt_br: Não se preocupe em ler as longas listas de funções do PHP.

source: You can jump in, in a short time, and start writing simple scripts in a few hours.
pt_br: Você pode pular essa parte (por enquanto) e começar a escrever scripts em poucas horas.

source: Although PHP 's development is focused on server-side scripting, you can do much more with it.
pt_br: Apesar do desenvolvimento do PHP ser focado nos scripts do lado do servidor, você pode fazer muito mais com ele.

source: Read on, and see more in the What can PHP do? section.
pt_br: Veja isso e leia mais na seção O que o PHP pode fazer?.

source: Getting Started
pt_br: Começando

source: What can PHP do?
pt_br: O que o PHP pode fazer?

source: Chapter 1.
pt_br: Capítulo 1.

source: Anything.
pt_br: Qualquer coisa.
